app/views/blogs/_form.html.erb

    <%= f.label :topic_id %>
    <%= f.collection_select(:topic_id, Topic.all, :id, :title,
                              {
                                include_blank: true
                              },
                              class: 'form-control'
                            )
---
SELECT "topics".* FROM "topics"