app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def index
    @blogs= Blog.paginate(:page => params[:page], :per_page => 5).order('created_at DESC')

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 10]]
---
  def show
    if logged_in?(:site_admin) || @blog.published?
      @blog = Blog.includes(:comments).friendly.find(params[:id])

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug", "topic_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "status" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["status", 1], ["updated_at", "2018-11-05 17:15:36.216298"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)