app/controllers/pages_controller.rb

SELECT "skills".* FROM "skills" ORDER BY percent DESC
---
  def about
    @skills = Skill.all