app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios" ORDER BY position ASC
---
  def index
    @portfolio_items = Portfolio.all