app/controllers/portfolios_controller.rb

  def sort
    params[:order].each do |key, value|
      Portfolio.find(value[:id]).update(position: value[:position])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "portfolios" SET "position" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["position", 1], ["updated_at", "2018-11-11 12:51:44.872376"], ["id", 2]]

  def create
    @portfolio_item = Portfolio.new(portfolio_params)

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at", "image_url") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @portfolio_item.update(portfolio_params)
---
UPDATE "portfolios" SET "link" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["link", "https://dazzling-mccarthy-033956.netlify.com/"], ["updated_at", "2018-11-15 12:56:14.259170"], ["id", 10]]

  def destroy
    # Destroy/delete the record
    @portfolio_item.destroy
---
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 9]]

  def set_portfolio_item
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]